### Terraform Plan — `prod`

```
module.doubleday.module.api.data.aws_route53_zone.main: Reading...
module.doubleday.data.aws_secretsmanager_secret_version.google_oauth: Reading...
module.doubleday.module.step_function.aws_cloudwatch_log_group.pipeline: Refreshing state... [id=/aws/stepfunction/doubleday-prod-pipeline]
module.doubleday.module.lambda.aws_iam_role.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging]
module.doubleday.module.lambda.aws_iam_role.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.doubleday.module.step_function.aws_iam_role.pipeline: Refreshing state... [id=doubleday-prod-pipeline]
module.doubleday.module.lambda.aws_iam_role.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.doubleday.module.lambda.aws_iam_role.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.doubleday.module.lambda.aws_iam_role.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.doubleday.module.glue.aws_glue_catalog_database.main: Refreshing state... [id=291743709387:doubleday_prod]
module.doubleday.module.s3.aws_s3_bucket.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.lambda.aws_lambda_function.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging]
module.doubleday.module.lambda.aws_lambda_function.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.doubleday.module.lambda.aws_iam_role_policy.validate_input: Refreshing state... [id=doubleday-prod-validate-input:doubleday-prod-validate-input]
module.doubleday.module.lambda.aws_lambda_function.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.doubleday.module.lambda.aws_lambda_function.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.doubleday.module.api.data.aws_route53_zone.main: Read complete after 0s [id=Z1WGWAH1KA6CLS]
module.doubleday.module.s3.aws_s3_bucket_public_access_block.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.s3.aws_s3_bucket_server_side_encryption_configuration.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.lambda.aws_iam_role_policy.gold_load: Refreshing state... [id=doubleday-prod-gold-load:doubleday-prod-gold-load]
module.doubleday.module.lambda.aws_lambda_function.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.doubleday.module.glue.null_resource.silver_pitches_table: Refreshing state... [id=6545119109490943370]
module.doubleday.module.glue.null_resource.gold_pitches_shape_season_table: Refreshing state... [id=3679298051484024578]
module.doubleday.module.lambda.aws_iam_role_policy.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging:doubleday-prod-clear-staging]
module.doubleday.module.lambda.aws_iam_role_policy.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load:doubleday-prod-bronze-load]
module.doubleday.module.lambda.aws_iam_role_policy.silver_load: Refreshing state... [id=doubleday-prod-silver-load:doubleday-prod-silver-load]
module.doubleday.module.glue.null_resource.silver_pitches_staging_table: Refreshing state... [id=1918109444834322555]
module.doubleday.module.glue.aws_glue_catalog_table.bronze_statcast: Refreshing state... [id=291743709387:doubleday_prod:bronze_statcast]
module.doubleday.module.step_function.aws_iam_role_policy.pipeline: Refreshing state... [id=doubleday-prod-pipeline:doubleday-prod-pipeline]
module.doubleday.module.step_function.aws_sfn_state_machine.pipeline: Refreshing state... [id=arn:aws:states:us-east-1:291743709387:stateMachine:doubleday-prod-pipeline]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.doubleday.data.archive_file.lambda_package will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_package" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/doubleday/../../../builds/lambda_package.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/doubleday/../../../builds/lambda_package"
      + type                = "zip"
    }

  # module.doubleday.null_resource.lambda_deps will be created
  + resource "null_resource" "lambda_deps" {
      + id       = (known after apply)
      + triggers = {
          + "requirements" = "PyJWT cryptography"
        }
    }

  # module.doubleday.null_resource.lambda_package_build will be created
  + resource "null_resource" "lambda_package_build" {
      + id       = (known after apply)
      + triggers = {
          + "deps"          = (known after apply)
          + "sql_api_hash"  = "ba67b3a4e68a7e6e689fb06dacd850e4138aa75a"
          + "sql_pipe_hash" = "6c3750313ed25c434d1fffa7ad5809cf9f2b26c1"
          + "src_hash"      = "8f10eea5c5569caccb41ac54277ea25e09dcae82"
        }
    }

  # module.doubleday.module.api.aws_acm_certificate.api will be created
  + resource "aws_acm_certificate" "api" {
      + arn                       = (known after apply)
      + domain_name               = "doubleday.appleforge.com"
      + domain_validation_options = [
          + {
              + domain_name           = "doubleday.appleforge.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "doubleday.appleforge.com",
        ]
      + tags_all                  = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.doubleday.module.api.aws_acm_certificate_validation.api will be created
  + resource "aws_acm_certificate_validation" "api" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_api_key.main will be created
  + resource "aws_api_gateway_api_key" "main" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "doubleday-prod-api-key"
      + tags_all          = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + value             = (sensitive value)
    }

  # module.doubleday.module.api.aws_api_gateway_domain_name.main will be created
  + resource "aws_api_gateway_domain_name" "main" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "doubleday.appleforge.com"
      + domain_name_id                         = (known after apply)
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_certificate_arn               = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }

      + endpoint_configuration {
          + ip_address_type = (known after apply)
          + types           = [
              + "REGIONAL",
            ]
        }
    }

  # module.doubleday.module.api.aws_api_gateway_integration.options_pitches will be created
  + resource "aws_api_gateway_integration" "options_pitches" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.doubleday.module.api.aws_api_gateway_integration_response.options_pitches will be created
  + resource "aws_api_gateway_integration_response" "options_pitches" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.doubleday.module.api.aws_api_gateway_method.options_pitches will be created
  + resource "aws_api_gateway_method" "options_pitches" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_method_response.options_pitches will be created
  + resource "aws_api_gateway_method_response" "options_pitches" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.doubleday.module.api.aws_api_gateway_resource.pitcher will be created
  + resource "aws_api_gateway_resource" "pitcher" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{pitcher_id}"
      + rest_api_id = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_resource.pitchers will be created
  + resource "aws_api_gateway_resource" "pitchers" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "pitchers"
      + rest_api_id = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_resource.pitches will be created
  + resource "aws_api_gateway_resource" "pitches" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "pitches"
      + rest_api_id = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Doubleday REST API (prod)"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "doubleday-prod-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }

      + endpoint_configuration (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role.authorizer will be created
  + resource "aws_iam_role" "authorizer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doubleday-prod-api-authorizer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role.authorizer_invocation will be created
  + resource "aws_iam_role" "authorizer_invocation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doubleday-prod-api-auth-invocation"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role.query_pitches will be created
  + resource "aws_iam_role" "query_pitches" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doubleday-prod-api-query-pitches"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role_policy.authorizer will be created
  + resource "aws_iam_role_policy" "authorizer" {
      + id          = (known after apply)
      + name        = "doubleday-prod-api-authorizer"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role_policy.query_pitches will be created
  + resource "aws_iam_role_policy" "query_pitches" {
      + id          = (known after apply)
      + name        = "doubleday-prod-api-query-pitches"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "athena:StartQueryExecution",
                          + "athena:GetQueryExecution",
                          + "athena:GetQueryResults",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "glue:GetDatabase",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::doubleday-prod-lakehouse",
                          + "arn:aws:s3:::doubleday-prod-lakehouse/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:GetBucketLocation",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::appleforge-athena-query-results",
                          + "arn:aws:s3:::appleforge-athena-query-results/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.doubleday.module.api.aws_lambda_function.query_pitches will be created
  + resource "aws_lambda_function" "query_pitches" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/doubleday/../../../builds/lambda_package.zip"
      + function_name                  = "doubleday-prod-api-query-pitches"
      + handler                        = "doubleday.api.query_pitches.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:017000801446:layer:AWSLambdaPowertoolsPythonV3-python312-x86_64:15",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ATHENA_OUTPUT_BUCKET"         = "appleforge-athena-query-results"
              + "GLUE_DATABASE"                = "doubleday_prod"
              + "POWERTOOLS_METRICS_NAMESPACE" = "Doubleday"
              + "POWERTOOLS_SERVICE_NAME"      = "api_query_pitches"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.doubleday.module.api.aws_lambda_permission.query_pitches will be created
  + resource "aws_lambda_permission" "query_pitches" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "doubleday-prod-api-query-pitches"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.doubleday.module.api.aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "doubleday.appleforge.com"
      + type            = "A"
      + zone_id         = "Z1WGWAH1KA6CLS"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.doubleday.module.api.aws_route53_record.cert_validation["doubleday.appleforge.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1WGWAH1KA6CLS"
    }

  # module.doubleday.module.cognito.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "doubleday-prod"
      + sms_verification_message   = (known after apply)
      + tags_all                   = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config (known after apply)

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = false
          + require_uppercase                = true
          + temporary_password_validity_days = (known after apply)
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "email"
          + required            = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.doubleday.module.cognito.aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "doubleday-prod"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.doubleday.module.lambda.aws_lambda_function.bronze_load will be updated in-place
  ~ resource "aws_lambda_function" "bronze_load" {
      ~ filename                       = "../../modules/lambda/../../../builds/lambda_package.zip" -> "../../modules/doubleday/../../../builds/lambda_package.zip"
      ~ handler                        = "doubleday.lambdas.bronze_load.handler.handler" -> "doubleday.pipeline.bronze_load.handler.handler"
        id                             = "doubleday-prod-bronze-load"
      ~ last_modified                  = "2026-02-14T22:29:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I=" -> (known after apply)
        tags                           = {}
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.clear_staging will be updated in-place
  ~ resource "aws_lambda_function" "clear_staging" {
      ~ filename                       = "../../modules/lambda/../../../builds/lambda_package.zip" -> "../../modules/doubleday/../../../builds/lambda_package.zip"
      ~ handler                        = "doubleday.lambdas.clear_staging.handler.handler" -> "doubleday.pipeline.clear_staging.handler.handler"
        id                             = "doubleday-prod-clear-staging"
      ~ last_modified                  = "2026-02-14T22:29:12.363+0000" -> (known after apply)
      ~ source_code_hash               = "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I=" -> (known after apply)
        tags                           = {}
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.gold_load will be updated in-place
  ~ resource "aws_lambda_function" "gold_load" {
      ~ filename                       = "../../modules/lambda/../../../builds/lambda_package.zip" -> "../../modules/doubleday/../../../builds/lambda_package.zip"
      ~ handler                        = "doubleday.lambdas.gold_load.handler.handler" -> "doubleday.pipeline.gold_load.handler.handler"
        id                             = "doubleday-prod-gold-load"
      ~ last_modified                  = "2026-02-14T22:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I=" -> (known after apply)
        tags                           = {}
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.silver_load will be updated in-place
  ~ resource "aws_lambda_function" "silver_load" {
      ~ filename                       = "../../modules/lambda/../../../builds/lambda_package.zip" -> "../../modules/doubleday/../../../builds/lambda_package.zip"
      ~ handler                        = "doubleday.lambdas.silver_load.handler.handler" -> "doubleday.pipeline.silver_load.handler.handler"
        id                             = "doubleday-prod-silver-load"
      ~ last_modified                  = "2026-02-14T22:28:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I=" -> (known after apply)
        tags                           = {}
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.validate_input will be updated in-place
  ~ resource "aws_lambda_function" "validate_input" {
      ~ filename                       = "../../modules/lambda/../../../builds/lambda_package.zip" -> "../../modules/doubleday/../../../builds/lambda_package.zip"
      ~ handler                        = "doubleday.lambdas.validate_input.handler.handler" -> "doubleday.pipeline.validate_input.handler.handler"
        id                             = "doubleday-prod-validate-input"
      ~ last_modified                  = "2026-02-14T22:28:49.000+0000" -> (known after apply)
      ~ layers                         = [
          + "arn:aws:lambda:us-east-1:017000801446:layer:AWSLambdaPowertoolsPythonV3-python312-x86_64:15",
        ]
      ~ source_code_hash               = "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I=" -> (known after apply)
        tags                           = {}
        # (24 unchanged attributes hidden)

      + environment {
          + variables = {
              + "POWERTOOLS_METRICS_NAMESPACE" = "Doubleday"
              + "POWERTOOLS_SERVICE_NAME"      = "validate_input"
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 25 to add, 5 to change, 0 to destroy.

Error: reading Secrets Manager Secret Version (prod/doubleday/cognito_identity_provider/google_client_id|AWSCURRENT): couldn't find resource

  with module.doubleday.data.aws_secretsmanager_secret_version.google_oauth,
  on ../../modules/doubleday/main.tf line 1, in data "aws_secretsmanager_secret_version" "google_oauth":
   1: data "aws_secretsmanager_secret_version" "google_oauth" {

::error::Terraform exited with code 1.

```

*Triggered by @dcbove in #8*